[
  {
    "id": 1,
    "image": "https://img.icons8.com/color/512/google-play.png",
    "title": "Hero App Store",
    "companyName": "Hero Technologies",
    "description": "Hero App Store is your trusted digital marketplace designed to give users access to the latest, safest, and most exciting applications across all categories. With a clean and minimal interface, it allows users to explore trending, top-rated, and newly launched apps effortlessly.\n\nThe store ensures every app goes through a strict verification process, maintaining security and performance. You can view detailed reviews, read honest feedback, and compare app versions before downloading.\n\nWhether you're a gamer, creator, or business professional, Hero App Store brings together quality apps tailored to your needs—all optimized for fast download and seamless installation.",
    "size": 85,
    "reviews": 2400,
    "ratingAvg": 4.7,
    "downloads": 1.2,
    "ratings": [
      { "name": "5 star", "count": 1070 },
      { "name": "4 star", "count": 900 },
      { "name": "3 star", "count": 300 },
      { "name": "2 star", "count": 80 },
      { "name": "1 star", "count": 50 }
    ]
  },
  {
    "id": 2,
    "image": "https://img.icons8.com/color/512/spotify.png",
    "title": "Spotify",
    "companyName": "Spotify Ltd.",
    "description": "Spotify lets you stream millions of songs, albums, and podcasts from artists around the world. Its intelligent recommendation system personalizes your music experience and helps you discover new tracks based on your taste.\n\nYou can create playlists, follow your favorite artists, and share music with friends instantly. Spotify Premium unlocks offline playback and ad-free listening for uninterrupted enjoyment.\n\nWhether you’re relaxing, working out, or studying, Spotify curates the perfect soundtrack for every moment of your day.",
    "size": 62,
    "reviews": 5800,
    "ratingAvg": 4.6,
    "downloads": 25,
    "ratings": [
      { "name": "5 star", "count": 2450 },
      { "name": "4 star", "count": 1700 },
      { "name": "3 star", "count": 900 },
      { "name": "2 star", "count": 450 },
      { "name": "1 star", "count": 300 }
    ]
  },
  {
    "id": 3,
    "image": "https://img.icons8.com/color/512/instagram-new.png",
    "title": "Instagram",
    "companyName": "Meta Platforms Inc.",
    "description": "Instagram is a social media platform for sharing life’s moments through photos, videos, and stories. Its creative filters and editing tools help you express your style while connecting with millions of users globally.\n\nYou can follow friends, creators, and brands you love while exploring trends across fashion, travel, and entertainment. Instagram Reels adds a new layer of fun, letting users create engaging short-form videos with music and effects.\n\nFrom sharing memories to discovering new passions, Instagram is a vibrant space that brings creativity and community together.",
    "size": 98,
    "reviews": 9200,
    "ratingAvg": 4.4,
    "downloads": 35,
    "ratings": [
      { "name": "5 star", "count": 3650 },
      { "name": "4 star", "count": 2900 },
      { "name": "3 star", "count": 1200 },
      { "name": "2 star", "count": 800 },
      { "name": "1 star", "count": 650 }
    ]
  },
  {
    "id": 4,
    "image": "https://img.icons8.com/color/512/telegram-app.png",
    "title": "Telegram",
    "companyName": "Telegram FZ LLC",
    "description": "Telegram is a fast and secure cloud-based messaging app built for privacy and freedom. It lets you send messages, photos, videos, and files of any size instantly to individuals or groups.\n\nThe app is encrypted end-to-end and provides secret chats, custom themes, and powerful bots for automation. Telegram channels allow users to broadcast updates to large audiences effortlessly.\n\nWith multi-device sync and unlimited cloud storage, Telegram ensures seamless communication across all your platforms.",
    "size": 72,
    "reviews": 3800,
    "ratingAvg": 4.8,
    "downloads": 12,
    "ratings": [
      { "name": "5 star", "count": 2000 },
      { "name": "4 star", "count": 1100 },
      { "name": "3 star", "count": 400 },
      { "name": "2 star", "count": 200 },
      { "name": "1 star", "count": 100 }
    ]
  },
  {
    "id": 5,
    "image": "https://img.icons8.com/color/512/tiktok.png",
    "title": "TikTok",
    "companyName": "ByteDance",
    "description": "TikTok is a global platform for creating and watching short-form videos filled with creativity, humor, and trends. It empowers users to express themselves with a vast library of sounds, effects, and filters.\n\nCreators from around the world share challenges, tips, and entertaining content that make TikTok the hub of viral culture. The app’s algorithm ensures every user gets personalized recommendations.\n\nWhether you’re a viewer or a creator, TikTok’s endless stream of fun and innovation will keep you scrolling for hours.",
    "size": 95,
    "reviews": 10400,
    "ratingAvg": 4.3,
    "downloads": 60,
    "ratings": [
      { "name": "5 star", "count": 3400 },
      { "name": "4 star", "count": 3300 },
      { "name": "3 star", "count": 1700 },
      { "name": "2 star", "count": 1100 },
      { "name": "1 star", "count": 900 }
    ]
  },
  {
    "id": 6,
    "image": "https://img.icons8.com/color/512/youtube-play.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "description": "YouTube is the world’s largest video platform where billions of people watch, share, and create content every day. From tutorials and entertainment to live events, it offers endless diversity.\n\nThe platform supports creators of all levels through monetization and analytics tools. You can subscribe to your favorite channels, comment, and interact with communities around topics you love.\n\nWith YouTube Premium, you can enjoy ad-free viewing, offline downloads, and background play for uninterrupted experience.",
    "size": 120,
    "reviews": 15800,
    "ratingAvg": 4.5,
    "downloads": 80,
    "ratings": [
      { "name": "5 star", "count": 5400 },
      { "name": "4 star", "count": 4200 },
      { "name": "3 star", "count": 1800 },
      { "name": "2 star", "count": 1300 },
      { "name": "1 star", "count": 1100 }
    ]
  },
  {
    "id": 7,
    "image": "https://img.icons8.com/color/512/twitterx.png",
    "title": "X (Twitter)",
    "companyName": "X Corp.",
    "description": "X (formerly Twitter) connects you to real-time conversations happening across the globe. It’s a platform where news breaks, trends emerge, and voices are heard.\n\nYou can post updates, follow topics, and engage with communities that matter to you. X empowers open discussion and content discovery through hashtags and spaces.\n\nFrom politics to pop culture, X is your gateway to what’s happening right now in the world.",
    "size": 78,
    "reviews": 5100,
    "ratingAvg": 4.2,
    "downloads": 21,
    "ratings": [
      { "name": "5 star", "count": 1600 },
      { "name": "4 star", "count": 1600 },
      { "name": "3 star", "count": 900 },
      { "name": "2 star", "count": 600 },
      { "name": "1 star", "count": 400 }
    ]
  },
  {
    "id": 8,
    "image": "https://img.icons8.com/color/512/facebook.png",
    "title": "Facebook",
    "companyName": "Meta Platforms Inc.",
    "description": "Facebook helps you stay connected with friends, family, and the world around you. It allows you to share updates, photos, and join groups that match your interests.\n\nWith Facebook Marketplace and Reels, you can shop, sell, and create engaging videos right from your profile. The platform integrates seamlessly with Messenger and Instagram for unified communication.\n\nFrom connecting with old classmates to growing your business, Facebook continues to be a community-driven space for everyone.",
    "size": 90,
    "reviews": 7800,
    "ratingAvg": 4.1,
    "downloads": 90,
    "ratings": [
      { "name": "5 star", "count": 2600 },
      { "name": "4 star", "count": 2100 },
      { "name": "3 star", "count": 1300 },
      { "name": "2 star", "count": 1000 },
      { "name": "1 star", "count": 800 }
    ]
  },
  {
    "id": 9,
    "image": "https://img.icons8.com/color/512/amazon.png",
    "title": "Amazon Shopping",
    "companyName": "Amazon Mobile LLC",
    "description": "Amazon Shopping brings millions of products at your fingertips—from electronics and fashion to groceries and digital content. You can browse, compare, and order within seconds.\n\nIts intelligent recommendation engine personalizes your experience, suggesting items based on your browsing history and preferences. Secure payment options and fast delivery ensure a seamless shopping experience.\n\nWith exclusive deals and real-time order tracking, Amazon makes online shopping easier than ever before.",
    "size": 80,
    "reviews": 6700,
    "ratingAvg": 4.6,
    "downloads": 30,
    "ratings": [
      { "name": "5 star", "count": 2900 },
      { "name": "4 star", "count": 2000 },
      { "name": "3 star", "count": 800 },
      { "name": "2 star", "count": 600 },
      { "name": "1 star", "count": 400 }
    ]
  },
  {
    "id": 10,
    "image": "https://img.icons8.com/color/512/netflix.png",
    "title": "Netflix",
    "companyName": "Netflix Inc.",
    "description": "Netflix offers unlimited entertainment with movies, TV shows, documentaries, and exclusive originals. Stream instantly across devices with adaptive HD quality.\n\nPersonalized recommendations help you discover content tailored to your taste. You can download videos for offline viewing and enjoy multiple profiles for family sharing.\n\nWith award-winning productions and global reach, Netflix continues to redefine digital entertainment worldwide.",
    "size": 125,
    "reviews": 8900,
    "ratingAvg": 4.8,
    "downloads": 45,
    "ratings": [
      { "name": "5 star", "count": 6000 },
      { "name": "4 star", "count": 1800 },
      { "name": "3 star", "count": 600 },
      { "name": "2 star", "count": 300 },
      { "name": "1 star", "count": 200 }
    ]
  },
  {
    "id": 11,
    "image": "https://img.icons8.com/color/512/snapchat.png",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "description": "Snapchat is a fast and fun way to share moments with friends and family. With disappearing Snaps and Stories, it lets you express yourself freely through pictures, filters, and lenses.\n\nYou can stay in touch with your close circle, explore trending news, or discover creators around the world through Spotlight. Snap Map also helps you see where friends are and what’s happening nearby.\n\nSnapchat continues to evolve as a platform for creativity and communication, combining privacy, playfulness, and innovation all in one app.",
    "size": 70,
    "reviews": 5400,
    "ratingAvg": 4.3,
    "downloads": 30,
    "ratings": [
      { "name": "5 star", "count": 1900 },
      { "name": "4 star", "count": 1600 },
      { "name": "3 star", "count": 900 },
      { "name": "2 star", "count": 600 },
      { "name": "1 star", "count": 400 }
    ]
  },
  {
    "id": 12,
    "image": "https://img.icons8.com/color/512/whatsapp.png",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms Inc.",
    "description": "WhatsApp Messenger is a reliable and secure communication platform used by billions worldwide. It allows free messaging, voice, and video calls with end-to-end encryption.\n\nYou can share photos, videos, and documents instantly or create group chats for friends, families, or businesses. The app syncs seamlessly across devices, keeping your messages always up to date.\n\nWhatsApp also offers Channels, Communities, and Business tools to connect users beyond simple chatting—making it a complete communication ecosystem.",
    "size": 85,
    "reviews": 10200,
    "ratingAvg": 4.7,
    "downloads": 100,
    "ratings": [
      { "name": "5 star", "count": 5000 },
      { "name": "4 star", "count": 3200 },
      { "name": "3 star", "count": 1200 },
      { "name": "2 star", "count": 500 },
      { "name": "1 star", "count": 300 }
    ]
  },
  {
    "id": 13,
    "image": "https://img.icons8.com/color/512/linkedin.png",
    "title": "LinkedIn",
    "companyName": "LinkedIn Corporation",
    "description": "LinkedIn is the world’s largest professional networking platform where individuals and businesses connect to grow their careers. It helps you find job opportunities, showcase your skills, and build meaningful connections.\n\nYou can follow companies, join industry discussions, and stay informed about global professional trends. Recruiters and employers also use LinkedIn to find the right candidates for their teams.\n\nWhether you’re job hunting, hiring, or simply expanding your network, LinkedIn empowers you to shape your professional future.",
    "size": 92,
    "reviews": 4100,
    "ratingAvg": 4.5,
    "downloads": 15,
    "ratings": [
      { "name": "5 star", "count": 1900 },
      { "name": "4 star", "count": 1300 },
      { "name": "3 star", "count": 500 },
      { "name": "2 star", "count": 250 },
      { "name": "1 star", "count": 150 }
    ]
  },
  {
    "id": 14,
    "image": "https://img.icons8.com/color/512/pinterest.png",
    "title": "Pinterest",
    "companyName": "Pinterest Inc.",
    "description": "Pinterest is a visual discovery engine that inspires creativity and ideas for every aspect of life. From home design and recipes to travel and style, it lets you explore millions of pins shared by users around the world.\n\nYou can save your favorite ideas to personalized boards and even shop products directly from the app. Pinterest uses intelligent recommendations to show you the content you’ll love most.\n\nIt’s more than an app—it’s a creative companion that sparks imagination and helps you turn inspiration into action.",
    "size": 77,
    "reviews": 3700,
    "ratingAvg": 4.6,
    "downloads": 10,
    "ratings": [
      { "name": "5 star", "count": 1800 },
      { "name": "4 star", "count": 1100 },
      { "name": "3 star", "count": 500 },
      { "name": "2 star", "count": 200 },
      { "name": "1 star", "count": 100 }
    ]
  },
  {
    "id": 15,
    "image": "https://img.icons8.com/color/512/google-maps.png",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "description": "Google Maps is a navigation and mapping platform that helps you explore the world with accuracy and convenience. From real-time traffic updates to detailed street views, it provides everything you need to travel smarter.\n\nIt offers step-by-step directions for driving, walking, cycling, and public transport. You can also find local businesses, restaurants, and landmarks with trusted reviews and ratings.\n\nWhether you’re planning a trip or discovering a new city, Google Maps ensures every journey is fast, safe, and effortless.",
    "size": 130,
    "reviews": 12500,
    "ratingAvg": 4.7,
    "downloads": 90,
    "ratings": [
      { "name": "5 star", "count": 6200 },
      { "name": "4 star", "count": 3800 },
      { "name": "3 star", "count": 1400 },
      { "name": "2 star", "count": 700 },
      { "name": "1 star", "count": 400 }
    ]
  }
]
