[
  {
    "id": 1,
    "image": "https://img.icons8.com/color/512/google-play.png",
    "title": "Hero App Store",
    "companyName": "Hero Technologies",
    "description": "Hero App Store is a trusted digital marketplace that offers users a wide selection of secure, high-quality applications across various categories. The platform is designed with a clean and user-friendly interface, allowing effortless browsing through trending, top-rated, and new apps. Each application undergoes a strict security and performance check before publishing, ensuring user safety and reliability. Hero App Store also provides detailed reviews, ratings, and version comparisons to help users make informed decisions. Whether you are looking for productivity tools, entertainment apps, or educational resources, Hero App Store delivers everything in one place with smooth installation and fast downloads.",
    "size": 85,
    "reviews": "2.4K",
    "ratingAvg": 4.7,
    "downloads": 1.2,
    "ratings": [
      { "name": "5 star", "count": 1070 },
      { "name": "4 star", "count": 900 },
      { "name": "3 star", "count": 300 },
      { "name": "2 star", "count": 80 },
      { "name": "1 star", "count": 50 }
    ]
  },
  {
    "id": 2,
    "image": "https://img.icons8.com/color/512/spotify.png",
    "title": "Spotify",
    "companyName": "Spotify Ltd.",
    "description": "Spotify is one of the world’s leading music streaming platforms, giving you instant access to millions of songs, albums, and podcasts. With smart recommendations based on your listening habits, Spotify curates playlists tailored to your taste. Users can create custom playlists, explore trending tracks, and share music with friends anytime. Spotify Premium enables offline playback, higher sound quality, and an ad-free experience for uninterrupted listening. From relaxing tunes to workout beats, Spotify helps you find the perfect soundtrack for every moment.",
    "size": 62,
    "reviews": "5.8K",
    "ratingAvg": 4.6,
    "downloads": 25,
    "ratings": [
      { "name": "5 star", "count": 2450 },
      { "name": "4 star", "count": 1700 },
      { "name": "3 star", "count": 900 },
      { "name": "2 star", "count": 450 },
      { "name": "1 star", "count": 300 }
    ]
  },
  {
    "id": 3,
    "image": "https://img.icons8.com/color/512/instagram-new.png",
    "title": "Instagram",
    "companyName": "Meta Platforms Inc.",
    "description": "Instagram is a popular social media platform that lets users share photos, videos, and stories with a global audience. With its advanced editing tools and filters, users can creatively express themselves while connecting with friends, family, and followers. Instagram’s Reels feature enables short-form video creation with music, transitions, and effects. You can follow your favorite creators, explore new trends, and engage with communities across different interests. From everyday updates to artistic content, Instagram makes sharing moments simple, fast, and visually appealing.",
    "size": 98,
    "reviews": "9.2K",
    "ratingAvg": 4.4,
    "downloads": 35,
    "ratings": [
      { "name": "5 star", "count": 3650 },
      { "name": "4 star", "count": 2900 },
      { "name": "3 star", "count": 1200 },
      { "name": "2 star", "count": 800 },
      { "name": "1 star", "count": 650 }
    ]
  },
  {
    "id": 4,
    "image": "https://img.icons8.com/color/512/telegram-app.png",
    "title": "Telegram",
    "companyName": "Telegram FZ LLC",
    "description": "Telegram is a fast and secure messaging application that prioritizes user privacy and reliability. It allows you to send text messages, photos, videos, and large files instantly to individuals or groups. Telegram’s advanced encryption ensures your data remains private, while its cloud-based design enables access from any device. With features like secret chats, custom themes, and public channels, Telegram offers a unique messaging experience. Users can also automate tasks using bots and enjoy unlimited storage for messages and media.",
    "size": 72,
    "reviews": "3.8K",
    "ratingAvg": 4.8,
    "downloads": 12,
    "ratings": [
      { "name": "5 star", "count": 2000 },
      { "name": "4 star", "count": 1100 },
      { "name": "3 star", "count": 400 },
      { "name": "2 star", "count": 200 },
      { "name": "1 star", "count": 100 }
    ]
  },
  {
    "id": 5,
    "image": "https://img.icons8.com/color/512/tiktok.png",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "description": "TikTok is a short-form video platform where creativity and entertainment meet. Users can create and share engaging videos with music, filters, and effects in just a few taps. With an intelligent recommendation system, TikTok tailors your feed to your interests, showing content you love from around the world. Whether it’s comedy, dance, or educational clips, TikTok offers something for everyone. The app provides simple editing tools and trending audio tracks to help users produce professional-looking videos quickly.",
    "size": 115,
    "reviews": "8.6K",
    "ratingAvg": 4.5,
    "downloads": 40,
    "ratings": [
      { "name": "5 star", "count": 4100 },
      { "name": "4 star", "count": 2500 },
      { "name": "3 star", "count": 1100 },
      { "name": "2 star", "count": 550 },
      { "name": "1 star", "count": 350 }
    ]
  },
  {
    "id": 6,
    "image": "https://img.icons8.com/color/512/whatsapp.png",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms Inc.",
    "description": "WhatsApp Messenger is a free, secure, and easy-to-use communication platform that connects people globally. You can send messages, photos, voice notes, and videos instantly, or make voice and video calls over the internet. The app uses end-to-end encryption to ensure your conversations remain private. WhatsApp supports group chats, status updates, and file sharing for both personal and business communication. With its lightweight design and global reach, WhatsApp makes staying connected simple and efficient anywhere in the world.",
    "size": 59,
    "reviews": "7.4K",
    "ratingAvg": 4.7,
    "downloads": 50,
    "ratings": [
      { "name": "5 star", "count": 3200 },
      { "name": "4 star", "count": 2100 },
      { "name": "3 star", "count": 1100 },
      { "name": "2 star", "count": 600 },
      { "name": "1 star", "count": 400 }
    ]
  },
  {
    "id": 7,
    "image": "https://img.icons8.com/color/512/facebook-new.png",
    "title": "Facebook",
    "companyName": "Meta Platforms Inc.",
    "description": "Facebook is a social networking platform designed to help people connect and share with friends, family, and communities worldwide. Users can post updates, upload photos, share videos, and join groups that match their interests. Facebook also provides a marketplace for buying and selling items locally. The app offers strong privacy controls, personalized feeds, and event organization tools. Whether for business promotion or personal connections, Facebook remains one of the most versatile social platforms available today.",
    "size": 130,
    "reviews": "10.3K",
    "ratingAvg": 4.3,
    "downloads": 60,
    "ratings": [
      { "name": "5 star", "count": 4100 },
      { "name": "4 star", "count": 2800 },
      { "name": "3 star", "count": 1300 },
      { "name": "2 star", "count": 900 },
      { "name": "1 star", "count": 600 }
    ]
  },
  {
    "id": 8,
    "image": "https://img.icons8.com/color/512/twitterx.png",
    "title": "X (Twitter)",
    "companyName": "X Corp.",
    "description": "X (formerly Twitter) is a platform for real-time news, discussions, and social interaction. It enables users to share short posts, follow trending topics, and engage with global communities. The app supports text, photos, and videos while offering verified profiles and advanced analytics for creators. Users can stay updated on breaking news, entertainment, and public conversations as they happen. With customizable timelines and smart notifications, X helps you stay informed and connected anytime, anywhere.",
    "size": 80,
    "reviews": "4.9K",
    "ratingAvg": 4.2,
    "downloads": 22,
    "ratings": [
      { "name": "5 star", "count": 2000 },
      { "name": "4 star", "count": 1400 },
      { "name": "3 star", "count": 800 },
      { "name": "2 star", "count": 400 },
      { "name": "1 star", "count": 300 }
    ]
  },
  {
    "id": 9,
    "image": "https://img.icons8.com/color/512/youtube-play.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "description": "YouTube is the world’s largest video-sharing platform, allowing users to watch, upload, and share videos across a wide range of categories. From tutorials and vlogs to music and entertainment, YouTube offers endless content for every interest. Users can subscribe to channels, create playlists, and interact through comments and live chats. The app also supports offline downloads and background playback for premium subscribers. Whether learning new skills or exploring entertainment, YouTube delivers a personalized viewing experience.",
    "size": 92,
    "reviews": "12.5K",
    "ratingAvg": 4.6,
    "downloads": 100,
    "ratings": [
      { "name": "5 star", "count": 5200 },
      { "name": "4 star", "count": 3500 },
      { "name": "3 star", "count": 1900 },
      { "name": "2 star", "count": 1100 },
      { "name": "1 star", "count": 800 }
    ]
  },
  {
    "id": 10,
    "image": "https://img.icons8.com/color/512/snapchat.png",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "description": "Snapchat is a multimedia messaging app focused on quick, fun, and private communication. Users can send photos and videos that disappear after viewing, or post stories that last 24 hours. Snapchat’s creative filters, AR lenses, and Bitmoji features make sharing moments more interactive. The app also includes Snap Map, letting you see where friends are and what’s happening nearby. With frequent updates and enhanced privacy options, Snapchat continues to be a favorite for spontaneous sharing among young audiences.",
    "size": 95,
    "reviews": "6.1K",
    "ratingAvg": 4.4,
    "downloads": 28,
    "ratings": [
      { "name": "5 star", "count": 2700 },
      { "name": "4 star", "count": 1800 },
      { "name": "3 star", "count": 800 },
      { "name": "2 star", "count": 450 },
      { "name": "1 star", "count": 350 }
    ]
  },
  {
    "id": 11,
    "image": "https://img.icons8.com/color/512/zoom.png",
    "title": "Zoom Cloud Meetings",
    "companyName": "Zoom Video Communications, Inc.",
    "description": "Zoom Cloud Meetings is a leading video conferencing app trusted by professionals and organizations worldwide. It allows users to host or join meetings, webinars, and virtual events with HD video and audio. Features like screen sharing, breakout rooms, and live chat make collaboration simple and effective. Zoom ensures secure communication through encryption and password protection. Whether for business, education, or personal use, Zoom provides a reliable and easy-to-use solution for remote connection.",
    "size": 120,
    "reviews": "6.9K",
    "ratingAvg": 4.5,
    "downloads": 20,
    "ratings": [
      { "name": "5 star", "count": 2800 },
      { "name": "4 star", "count": 2100 },
      { "name": "3 star", "count": 900 },
      { "name": "2 star", "count": 600 },
      { "name": "1 star", "count": 500 }
    ]
  },
  {
    "id": 12,
    "image": "https://img.icons8.com/color/512/linkedin.png",
    "title": "LinkedIn",
    "companyName": "LinkedIn Corporation",
    "description": "LinkedIn is the world’s largest professional networking platform, connecting millions of job seekers, employers, and businesses. Users can create a detailed profile showcasing their skills, experiences, and achievements. The app helps professionals discover job opportunities, learn industry insights, and grow their careers. LinkedIn also features courses, company pages, and personalized news feeds to stay informed about the latest trends. Whether you're hiring or job hunting, LinkedIn keeps you connected to your professional community.",
    "size": 85,
    "reviews": "4.1K",
    "ratingAvg": 4.3,
    "downloads": 18,
    "ratings": [
      { "name": "5 star", "count": 1900 },
      { "name": "4 star", "count": 1300 },
      { "name": "3 star", "count": 500 },
      { "name": "2 star", "count": 250 },
      { "name": "1 star", "count": 150 }
    ]
  },
  {
    "id": 13,
    "image": "https://img.icons8.com/color/512/discord-logo.png",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "description": "Discord is a communication app built for communities, gamers, and creators. It allows users to join servers, chat via text, voice, or video, and share media instantly. Discord supports both public and private channels, giving users control over their interactions. With low-latency voice calls and customizable bots, Discord has become a favorite for group collaboration and entertainment. Whether chatting with friends or managing a large community, Discord makes staying connected easy and organized.",
    "size": 105,
    "reviews": "5.6K",
    "ratingAvg": 4.7,
    "downloads": 15,
    "ratings": [
      { "name": "5 star", "count": 2600 },
      { "name": "4 star", "count": 1800 },
      { "name": "3 star", "count": 700 },
      { "name": "2 star", "count": 300 },
      { "name": "1 star", "count": 200 }
    ]
  },
  {
    "id": 14,
    "image": "https://img.icons8.com/color/512/reddit.png",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "description": "Reddit is a network of communities where users can share content, join discussions, and explore topics they love. Each subreddit focuses on a unique theme — from technology and gaming to news and humor. Users can post, comment, and upvote content to shape community trends. The app features personalized feeds and notification controls for a better browsing experience. Reddit combines the best of social interaction and discovery in one easy-to-use platform.",
    "size": 78,
    "reviews": "3.9K",
    "ratingAvg": 4.4,
    "downloads": 17,
    "ratings": [
      { "name": "5 star", "count": 1800 },
      { "name": "4 star", "count": 1200 },
      { "name": "3 star", "count": 500 },
      { "name": "2 star", "count": 250 },
      { "name": "1 star", "count": 150 }
    ]
  },
  {
    "id": 15,
    "image": "https://img.icons8.com/color/512/pinterest--v1.png",
    "title": "Pinterest",
    "companyName": "Pinterest Inc.",
    "description": "Pinterest is a creative discovery platform where users find inspiration for projects, design ideas, and lifestyle goals. You can explore millions of pins across categories such as fashion, food, home decor, and technology. Users can save, organize, and share ideas by creating custom boards. Pinterest also provides shopping features, allowing direct product purchases from pins. Whether you’re planning a renovation or looking for creative tips, Pinterest helps you discover and organize what inspires you most.",
    "size": 90,
    "reviews": "4.4K",
    "ratingAvg": 4.5,
    "downloads": 22,
    "ratings": [
      { "name": "5 star", "count": 2100 },
      { "name": "4 star", "count": 1400 },
      { "name": "3 star", "count": 600 },
      { "name": "2 star", "count": 200 },
      { "name": "1 star", "count": 100 }
    ]
  },
  {
    "id": 16,
    "image": "https://img.icons8.com/color/512/netflix.png",
    "title": "Netflix",
    "companyName": "Netflix Inc.",
    "description": "Netflix is a global streaming service offering thousands of movies, TV shows, and documentaries. Users can enjoy ad-free content in HD and 4K resolution across multiple devices. Netflix’s recommendation engine suggests content based on your viewing history. The app also supports offline downloads, profiles for family members, and parental controls. Whether you love action, drama, or comedy, Netflix provides endless entertainment at your fingertips.",
    "size": 115,
    "reviews": "9.7K",
    "ratingAvg": 4.6,
    "downloads": 45,
    "ratings": [
      { "name": "5 star", "count": 4500 },
      { "name": "4 star", "count": 2800 },
      { "name": "3 star", "count": 1200 },
      { "name": "2 star", "count": 700 },
      { "name": "1 star", "count": 500 }
    ]
  },
  {
    "id": 17,
    "image": "https://img.icons8.com/color/512/amazon.png",
    "title": "Amazon Shopping",
    "companyName": "Amazon Mobile LLC",
    "description": "Amazon Shopping is a comprehensive e-commerce app that lets users browse, compare, and purchase millions of products from around the world. The app offers personalized recommendations, secure checkout, and fast delivery options including Prime. Users can track orders, read reviews, and access deals in real time. With integrated customer support and multiple payment options, Amazon Shopping provides a convenient and reliable online shopping experience.",
    "size": 95,
    "reviews": "8.3K",
    "ratingAvg": 4.7,
    "downloads": 70,
    "ratings": [
      { "name": "5 star", "count": 3900 },
      { "name": "4 star", "count": 2600 },
      { "name": "3 star", "count": 1000 },
      { "name": "2 star", "count": 500 },
      { "name": "1 star", "count": 300 }
    ]
  },
  {
    "id": 18,
    "image": "https://img.icons8.com/color/512/github.png",
    "title": "GitHub",
    "companyName": "GitHub Inc.",
    "description": "GitHub is a development platform that enables software engineers to collaborate, share code, and manage projects. The mobile app lets you review pull requests, view issues, and stay connected to your repositories anywhere. GitHub supports version control using Git and integrates with CI/CD tools for continuous deployment. Developers can explore open-source projects or contribute to existing ones directly through the platform. With GitHub, teamwork and code management become seamless and efficient.",
    "size": 68,
    "reviews": "3.2K",
    "ratingAvg": 4.8,
    "downloads": 10,
    "ratings": [
      { "name": "5 star", "count": 1800 },
      { "name": "4 star", "count": 900 },
      { "name": "3 star", "count": 300 },
      { "name": "2 star", "count": 120 },
      { "name": "1 star", "count": 80 }
    ]
  },
  {
    "id": 19,
    "image": "https://img.icons8.com/color/512/canva.png",
    "title": "Canva",
    "companyName": "Canva Pty Ltd.",
    "description": "Canva is an easy-to-use graphic design platform that allows anyone to create stunning visuals in minutes. With thousands of free templates for social media posts, logos, presentations, and posters, Canva simplifies design for both beginners and professionals. Users can drag and drop elements, customize fonts and colors, and collaborate in real time. Whether for personal projects or business branding, Canva makes professional design accessible to everyone.",
    "size": 110,
    "reviews": "7.1K",
    "ratingAvg": 4.8,
    "downloads": 35,
    "ratings": [
      { "name": "5 star", "count": 3200 },
      { "name": "4 star", "count": 2400 },
      { "name": "3 star", "count": 800 },
      { "name": "2 star", "count": 400 },
      { "name": "1 star", "count": 300 }
    ]
  },
  {
    "id": 20,
    "image": "https://img.icons8.com/color/512/google-maps-new.png",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "description": "Google Maps provides accurate navigation, real-time traffic updates, and local business information to make travel easy. Users can find directions for driving, walking, cycling, or public transit anywhere in the world. The app features voice-guided GPS navigation, street view, and offline map downloads. Google Maps also offers recommendations for restaurants, hotels, and attractions based on reviews and location. Whether planning a trip or finding the fastest route, Google Maps is your trusted travel companion.",
    "size": 100,
    "reviews": "12.2K",
    "ratingAvg": 4.7,
    "downloads": 90,
    "ratings": [
      { "name": "5 star", "count": 5100 },
      { "name": "4 star", "count": 3400 },
      { "name": "3 star", "count": 1700 },
      { "name": "2 star", "count": 600 },
      { "name": "1 star", "count": 400 }
    ]
  }
]
